Revit 2027 API
ExternalServices.BuiltInExternalServices.RevisionsOnSheetUIService Property
 The UI service which permits registration of an external server for new UI managing RevisionsOnSheet selection
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId RevisionsOnSheetUIService { get; }
Public Shared ReadOnly Property RevisionsOnSheetUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ RevisionsOnSheetUIService {
	ExternalServiceId^ get ();
}
static member RevisionsOnSheetUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace